blog/org-to-web-site.org
#+TITLE: 用 =org mode= 写一个本地静态网站
#+AUTHOR: 刘恩泽
#+URI:         /blog/%y/%m/%d/org-to-web-site
#+KEYWORDS:    emacs, org-mode
#+TAGS:        emacs, org-mode
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: 用 =org mode= 写一个本地静态网站
#+EMAIL:  liuenze6516@gmail.com
#+DATE: 2019-09-11
#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation, bigger]
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)
#+BEAMER_THEME: metropolis
#+BIND: org-beamer-outline-frame-title "目录"

* 用途
工作中，文档写的很多，全部导出成 pdf 发出去，也会比较麻烦。所以萌生了本地起一个 web 服务, 直接发链接给内网同事的想法。更新起来也方便。

* 步骤
利用 org mode 的 publish 功能，配置步骤如下: 

1. 本地起一个 web 服务器(比如 nginx)即可
2. 配置 org-mode 的发布
   1. 配置静态资源的发布
   2. 配置 org 文档的发布

* web 服务器

#+begin_src shell
brew install nginx
#+end_src

mac 下，默认的静态目录为: =/usr/local/var/www=

* 配置 org-mode 的 project
修改参数: =org-publish-project-alist= 即可。
     
** 配置静态资源的发布
#+begin_src emacs-lisp
             ("org-agora-static"
              :base-directory "~/Documents/agora/"
              :base-extension "gz\\|eps\\|css\\|js\\|png\\|jpg\\|gif\\|mp3\\|ogg\\|swf"
              :publishing-directory "/usr/local/var/www"
              :recursive t
              :publishing-function org-publish-attachment
              )
#+end_src

** 配置 org 目录的发布

#+begin_src emacs-lisp
             ("org-agora-notes"
              :base-directory "~/Documents/agora/"
              :base-extension "org"
              :publishing-directory "/usr/local/var/www"
              :recursive t
              :publishing-function org-html-publish-to-html
              :headline-levels 3             ; Just the default for this project.
              :auto-preamble t
              :auto-sitemap t                ; Generate sitemap.org automagically...
              :sitemap-filename "index.org"  ; ... call it sitemap.org (it's the default)...
              :sitemap-format-entry org-sitemap-custom-entry-format
              :html-link-home "/"
              :sitemap-title "文档列表"         ; ... with title 'Sitemap'.
              :section-numbers nil
              :table-of-contents 2
              :sitemap-filename "index.org"
              :sitemap-sort-files anti-chronologically
              :exclude "index.org"
              :html-head-extra  "<link rel='stylesheet' type='text/css' href='../styles/readtheorg/css/htmlize.css'/><link rel='stylesheet' type='text/css' href='../styles/readtheorg/css/readtheorg.css'/>"
              )
#+end_src

** 配置 index 文件的发布

#+begin_src emacs-lisp
             ("org-agora-index"
              :base-directory "~/Documents/agora/"
              :base-extension "org"
              :exclude ".*"
              :include ["index.org"]
              :publishing-directory "/usr/local/var/www"
              :publishing-function org-html-publish-to-html
              :table-of-contents nil
              :html-head-extra  "<link rel='stylesheet' type='text/css' href='styles/readtheorg/css/htmlize.css'/><link rel='stylesheet' type='text/css' href='styles/readtheorg/css/readtheorg.css'/>"
              )
#+END_SRC

** 配置总项目
#+begin_src emacs-lisp
             ("org-agora" :components ("org-agora-notes" "org-agora-static" "org-agora-index" ))
#+end_src
** 配置项目的样式文件
拷贝 =https://github.com/fniessen/org-html-themes= 的样式文件至: =~/Documents/agora/=  （以自己的配置为准)

* 汇总配置

#+begin_src emacs-lisp
     (require 'ox-publish)
     (setq org-publish-project-alist
           '(
             ("org-agora-index"
              :base-directory "~/Documents/agora/"
              :base-extension "org"
              :exclude ".*"
              :include ["index.org"]
              :publishing-directory "/usr/local/var/www"
              :publishing-function org-html-publish-to-html
              :table-of-contents nil
              :html-head-extra  "<link rel='stylesheet' type='text/css' href='styles/readtheorg/css/htmlize.css'/><link rel='stylesheet' type='text/css' href='styles/readtheorg/css/readtheorg.css'/>"
              )
             ("org-agora-notes"
              :base-directory "~/Documents/agora/"
              :base-extension "org"
              :publishing-directory "/usr/local/var/www"
              :recursive t
              :publishing-function org-html-publish-to-html
              :headline-levels 3             ; Just the default for this project.
              :auto-preamble t
              :auto-sitemap t                ; Generate sitemap.org automagically...
              :sitemap-filename "index.org"  ; ... call it sitemap.org (it's the default)...
              :sitemap-format-entry org-sitemap-custom-entry-format
              :html-link-home "/"
              :sitemap-title "文档列表"         ; ... with title 'Sitemap'.
              :section-numbers nil
              :table-of-contents 2
              :sitemap-filename "index.org"
              :sitemap-sort-files anti-chronologically
              :exclude "index.org"
              :html-head-extra  "<link rel='stylesheet' type='text/css' href='../styles/readtheorg/css/htmlize.css'/><link rel='stylesheet' type='text/css' href='../styles/readtheorg/css/readtheorg.css'/>"
              )
             ("org-agora-static"
              :base-directory "~/Documents/agora/"
              :base-extension "gz\\|eps\\|css\\|js\\|png\\|jpg\\|gif\\|mp3\\|ogg\\|swf"
              :publishing-directory "/usr/local/var/www"
              :recursive t
              :publishing-function org-publish-attachment
              )
             ("org-agora" :components ("org-agora-notes" "org-agora-static" "org-agora-index" ))
             ))
#+end_src



* 发布样例

图片稍后补充
